src/domain/sci/transporter/broker/dpd/DpdCreateLabel.xml

<!-- request -->
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://www.cargonet.software">
  <soap:Header>
    <tns:UserCredentials>
      <tns:userid>test-DPDFrance</tns:userid>
      <tns:password>test-DPDFrance</tns:password>
    </tns:UserCredentials>
  </soap:Header>
  <soap:Body>
    <CreateShipmentWithLabels xmlns="http://www.cargonet.software">
      <request>
        <receiveraddress>
          <countryPrefix>FR</countryPrefix>
          <zipCode>31300</zipCode>
          <city>Toulouse</city>
          <street>36 route de bayonne C/C Carrefour, Indémodable</street>
          <name>LC Purpan</name>
          <phoneNumber>0659969984</phoneNumber>
        </receiveraddress>
        <receiverinfo>
          <contact>Loic Raymond</contact>
          <vinfo1>C/C Carrefour, Indémodable</vinfo1>
          <vinfo2></vinfo2>
        </receiverinfo>
        <shipperaddress>
          <countryPrefix>FR</countryPrefix>
          <zipCode>92230</zipCode>
          <city>GENNEVILLIERS</city>
          <street>429 allée bellecour</street>
          <name>Loicar</name>
          <phoneNumber>0659969984</phoneNumber>
        </shipperaddress>
        <overrideShipperLabelAddress>
          <countryPrefix>FR</countryPrefix>
          <zipCode>84200</zipCode>
          <city>Carpentras</city>
          <street>429 allée bellecour</street>
          <name>Loicar</name>
          <phoneNumber>0659969984</phoneNumber>
        </overrideShipperLabelAddress>
        <customer_countrycode>250</customer_countrycode>
        <customer_centernumber>77</customer_centernumber>
        <customer_number>18026</customer_number>
        <weight>1</weight>
        <referencenumber>ref 862981</referencenumber>
        <labelType>
          <type>PDF</type>
        </labelType>
        <shippingdate>28.10.2021</shippingdate>
        <retouraddress>
          <countryPrefix>FR</countryPrefix>
          <zipCode>84200</zipCode>
          <city>Carpentras</city>
          <street>429 allée bellecour</street>
          <name>firstS</name>
          <phoneNumber>0659969984</phoneNumber>
        </retouraddress>
        <services>
          <contact>
            <type>Predict</type>
            <sms>123</sms>
            <email></email>
          </contact>
          <extraInsurance>
            <value>10</value>
            <type>byShipments</type>
          </extraInsurance>
        </services>
      </request>
    </CreateShipmentWithLabels>
  </soap:Body>
</soap:Envelope>
